
const hardcodedQuestions = {
  1: {
    "q1": {
      "text": "ما هي عاصمة اليابان؟",
      "answer": "طوكيو",
      "image": ""
    },
    "q2": {
      "text": "من هو مخترع المصباح الكهربائي؟",
      "answer": "توماس إديسون",
      "image": ""
    },
    "q3": {
      "text": "ما هو العنصر الذي يرمز له بالرمز O؟",
      "answer": "الأكسجين",
      "image": ""
    },
    "q4": {
      "text": "ما هي أكبر قارة في العالم؟",
      "answer": "آسيا",
      "image": ""
    },
    "q5": {
      "text": "من كتب مسرحية 'روميو وجولييت'؟",
      "answer": "ويليام شكسبير",
      "image": ""
    },
    "q6": {
      "text": "ما اسم أطول جبل في العالم؟",
      "answer": "إيفرست",
      "image": ""
    },
    "q7": {
      "text": "من رسم لوحة الموناليزا؟",
      "answer": "ليوناردو دافنشي",
      "image": ""
    },
    "q8": {
      "text": "ما هي أسرع وسيلة نقل بري؟",
      "answer": "القطار  ",
      "image": ""
    },
    "q9": {
      "text": "ما هو أسرع طائر في العالم؟",
      "answer": " الشاهين",
      "image": ""
    },
    "q10": {
      "text": "ما هو الغاز الذي يشكل معظم الغلاف الجوي للأرض؟",
      "answer": "النيتروجين",
      "image": ""
    },
    "q11": {
      "text": "ما هو أسرع حيوان بري؟",
      "answer": "الفهد",
      "image": ""
    },
    "q12": {
      "text": "من هو الفنان الشهير الذي رسم 'ليلة النجوم'؟",
      "answer": "فان جوخ",
      "image": ""
    },
    "q13": {
      "text": "من اكتشف الجاذبية الأرضية؟",
      "answer": "إسحاق نيوتن",
      "image": ""
    },
    "q14": {
      "text": "ما هي اللغة الرسمية للبرازيل؟",
      "answer": "البرتغالية",
      "image": ""
    },
    "q15": {
      "text": "ما اسم أقرب نجم إلى الأرض؟",
      "answer": "الشمس",
      "image": ""
    },
    "q16": {
      "text": "ما هي عاصمة إسبانيا؟",
      "answer": "مدريد",
      "image": ""
    },
    "q17": {
      "text": "ما هي عاصمة كندا؟",
      "answer": "أوتاوا",
      "image": ""
    },
    "q18": {
      "text": "ما هو الحيوان الوطني لأستراليا؟",
      "answer": "الكنغر",
      "image": ""
    },
    "q19": {
      "text": "من هو مؤلف نظرية النسبية؟",
      "answer": " أينشتاين",
      "image": ""
    },
    "q20": {
      "text": "ما هي أصغر قارة في العالم؟",
      "answer": "أستراليا",
      "image": ""
    },
    "q21": {
      "text": "ما اسم أطول نهر في أفريقيا؟",
      "answer": "النيل",
      "image": ""
    },
    "q22": {
      "text": "من هو مؤسس شركة آبل؟",
      "answer": "ستيف جوبز",
      "image": ""
    },
    "q23": {
      "text": "ما هي عاصمة الصين؟",
      "answer": "بكين",
      "image": ""
    },
    "q24": {
      "text": "ما هو المعدن الأكثر توصيلاً للكهرباء؟",
      "answer": "الفضة",
      "image": ""
    },
    "q25": {
      "text": "ما هي عاصمة تركيا؟",
      "answer": "أنقرة",
      "image": ""
    },
    "q26": {
      "text": "ما هي أكبر دولة في العالم من حيث المساحة؟",
      "answer": "روسيا",
      "image": ""
    },
    "q27": {
      "text": "ما اسم القارة التي تقع فيها الهند؟",
      "answer": "آسيا",
      "image": ""
    },
    "q28": {
      "text": "من هو لاعب كرة القدم الحائز على أكبر عدد من الكرات الذهبية؟",
      "answer": "ليونيل ميسي",
      "image": ""
    },
    "q29": {
      "text": "ما هي عاصمة الأرجنتين؟",
      "answer": "بوينس آيرس",
      "image": ""
    },
    "q30": {
      "text": "ما هو الغاز الأكثر وفرة في الغلاف الجوي للأرض؟",
      "answer": "النيتروجين",
      "image": ""
    },
    "q31": {
      "text": "ما اسم اكبر هضبة في العالم؟",
      "answer": "هضبة التبت",
      "image": ""
    },
    "q32": {
      "text": "ما هي العملة الرسمية لليابان؟",
      "answer": "الين",
      "image": ""
    },
    "q33": {
      "text": "ما هي اكبر بحيرة في العالم من حيث المساحة؟",
      "answer": "بحيرة قزوين",
      "image": ""
    },
    "q34": {
      "text": "من هو مخترع الهاتف؟",
      "answer": "غراهام بيل",
      "image": ""
    },
    "q35": {
      "text": "ما هي عاصمة جنوب أفريقيا؟",
      "answer": "بريتوريا",
      "image": ""
    },
    "q36": {
      "text": "ما هو اسرع الطيور التي لا تطير",
      "answer": "النعامة",
      "image": ""
    },
    "q37": {
      "text": "من هو الفنان الذي رسم 'ليلة النجوم'؟",
      "answer": "فان جوخ",
      "image": ""
    },
    "q38": {
      "text": "ما هي اللغة الرسمية للنمسا؟",
      "answer": "الألمانية",
      "image": ""
    },
    "q39": {
      "text": "ما اسم أقدم جامعة في العالم؟",
      "answer": "جامعة القرويين",
      "image": ""
    },
    "q40": {
      "text": "من هو مؤلف 'ديوان المتنبي'؟",
      "answer": "المتنبي",
      "image": ""
    },
    "q41": {
      "text": "ما هي عاصمة إيران؟",
      "answer": "طهران",
      "image": ""
    },
    "q42": {
      "text": "ما هو المعدن السائل في درجة حرارة الغرفة؟",
      "answer": "الزئبق",
      "image": ""
    },
    "q43": {
      "text": "من هو أول رئيس للولايات المتحدة؟",
      "answer": "جورج واشنطن",
      "image": ""
    },
    "q44": {
      "text": "ما هي أكبر جزيرة في العالم؟",
      "answer": "غرينلاند",
      "image": ""
    },
    "q45": {
      "text": "ما اسم أطول نهر في أوروبا؟",
      "answer": "الفولجا",
      "image": ""
    },
    "q46": {
      "text": "ما هي وحدة قياس سرعة السفن؟",
      "answer": "عقدة",
      "image": ""
    },
    "q47": {
      "text": "ما هي عاصمة إسبانيا؟",
      "answer": "مدريد",
      "image": ""
    },
    "q48": {
      "text": "ما لون لسان الزرافة؟",
      "answer": "ازرق",
      "image": ""
    },
    "q49": {
      "text": "ما هي ثاني اكبر دولة في العالم؟",
      "answer": " كندا",
      "image": ""
    },
    "q50": {
      "text": "ما هي أصغر دولة في العالم؟",
      "answer": "الفاتيكان",
      "image": ""
    }
  },
  2: {
    "q1": {
      "text": "ماهي أول معركة في الإسلام؟",
      "answer": "بدر",
      "image": ""
    },
    "q2": {
      "text": "من هو أول نبي في الإسلام؟",
      "answer": "آدم عليه السلام",
      "image": ""
    },
    "q3": {
      "text": "ما اسم أعظم سورة في القرآن الكريم؟",
      "answer": "سورة الفاتحة",
      "image": ""
    },
    "q4": {
      "text": "كم عدد سور القرآن الكريم؟",
      "answer": "114 سورة",
      "image": ""
    },
    "q5": {
      "text": "من هي أم المؤمنين التي تُلقب بـ'الصديقة بنت الصديق'؟",
      "answer": "عائشة رضي الله عنها",
      "image": ""
    },
    "q6": {
      "text": "ما اسم الغار الذي كان يتعبد فيه النبي محمد ﷺ قبل البعثة؟",
      "answer": "غار حراء",
      "image": ""
    },
    "q7": {
      "text": "من أول الخلفاء الراشدين؟",
      "answer": "أبو بكر",
      "image": ""
    },
    "q8": {
      "text": "من هو النبي الذي سماه الله 'خليل الرحمن'؟",
      "answer": "إبراهيم عليه السلام",
      "image": ""
    },
    "q9": {
      "text": "ما هي السورة التي تسمى 'قلب القرآن'؟",
      "answer": "سورة يس",
      "image": ""
    },
    "q10": {
      "text": "كم عدد الركعات في صلاة الفرض اليومية؟",
      "answer": "17 ركعة",
      "image": ""
    },
    "q11": {
      "text": "من هو الصحابي الذي لقب بـ'سيف الله المسلول'؟",
      "answer": "خالد بن الوليد",
      "image": ""
    },
    "q12":{
      "text": "من هو الصحابي الذي قتله المشركون في غزوة أحد بمثلٍ وحشي؟",
      "answer": "حمزة بن عبد المطلب",
      "image": ""
    },
    "q13": {
      "text": "ما اسم والد النبي محمد ﷺ؟",
      "answer": "عبد الله بن عبد المطلب",
      "image": ""
    },
    "q14": {
      "text": "ما اسم القبلة الأولى للمسلمين؟",
      "answer": "بيت المقدس",
      "image": ""
    },
    "q15": {
      "text": "ما هي السورة التي تسمى 'عروس القرآن'؟",
      "answer": "سورة الرحمن",
      "image": ""
    },
    "q16": {
      "text": "من هو النبي الذي ابتلعه الحوت؟",
      "answer": "يونس عليه السلام",
      "image": ""
    },
    "q17": {
      "text": "من هي ابنة النبي التي تزوجها عثمان بن عفان؟",
      "answer": "رقية",
      "image": ""
    },
    "q18": {
      "text": "من هي المرأة التي لقبت بـ'ذات النطاقين'؟",
      "answer": "أسماء بنت أبي بكر",
      "image": ""
    },
    "q19": {
      "text": "ما اسم أول مسجد بني في الإسلام؟",
      "answer": "مسجد قباء",
      "image": ""
    },
    "q20": {
      "text": "كم عدد أبواب الجنة؟",
      "answer": "8 أبواب",
      "image": ""
    },
    "q21": {
      "text": "ما هي الصلاة التي يركع فيها المصلي أربع مرات؟",
      "answer": " صلاة الخسوف والكسوف",
      "image": ""
    },
    "q22": {
      "text": "من هو أول مؤذن في الإسلام؟",
      "answer": "بلال بن رباح",
      "image": ""
    },
    "q23": {
      "text": "ما هي اصغر سورة في القران؟",
      "answer": "سورة الكوثر",
      "image": ""
    },
    "q24": {
      "text": "من هو الملقب بـ'حبر الأمة'؟",
      "answer": "عبد الله بن عباس",
      "image": ""
    },
    "q25": {
      "text": "ما هي أعلى مراتب الجنة؟",
      "answer": "الْفِرْدَوْسُ",
      "image": ""
    },
    "q26": {
      "text": "من هو النبي الذي أرسل إلى قوم ثمود؟",
      "answer": "صالح عليه السلام",
      "image": ""
    },
    "q27": {
      "text": "ما اسم الغزوة التي أشار إليها القرآن بـ'العسرة'؟",
      "answer": "تبوك",
      "image": ""
    },
    "q28": {
      "text": "ما اسم السورة التي تُسمى 'النعم'؟",
      "answer": "النحل",
      "image": ""
    },
    "q29": {
      "text": "من هو الصحابي الذي دُفن مع النبي ﷺ في حجرته؟",
      "answer": "عمر بن الخطاب",
      "image": ""
    },
    "q30": {
      "text": "ما الاسم الآخر لـ'غزوة الخندق'؟",
      "answer": "الأحزاب",
      "image": ""
    },
    "q31": {
      "text": "كم مرة ذُكر اسم 'الرحمن' في سورة مريم؟",
      "answer": "16 مرة",
      "image": ""
    },
    "q32": {
      "text": "ما هي 'أشهر الحرم'؟",
      "answer": "ذو القعدة، ذو الحجة، محرم، رجب",
      "image": ""
    },
    "q33": {
      "text": "ما هي السورة التي تُسمى 'الساهرة' ؟",
      "answer": "سورة النازعات",
      "image": ""
    },
    "q34": {
      "text": "   اين نزلت سورة 'يوسف'؟",
      "answer": "مكة",
      "image": ""
    },
    "q35": {
      "text": "من هو الصحابي الذي اهتز لموته عرش الرحمن؟",
      "answer": "سعد بن معاذ",
      "image": ""
    },
    "q36": {
      "text": "من هو النبي الذي لقب بـ'كليم الله'؟",
      "answer": "موسى عليه السلام",
      "image": ""
    },
    "q37": {
      "text": "ما اسم المرأة التي حاولت قتل النبي ﷺ بالسم؟",
      "answer": "زينب بنت الحارث",
      "image": ""
    },
    "q38": {
      "text": "ما السورة التي تُسمى 'المنجيَّة'؟",
      "answer": "الملك",
      "image": ""
    },
    "q39": {
      "text": "ما السورة التي نزلت في قصة الإفك؟",
      "answer": "النور",
      "image": ""
    },
    "q40": {
      "text": "ما اسم السورة التي تُسمى 'الباسقات'؟",
      "answer": "سورة ق",
      "image": ""
    },
    "q41": {
      "text": "من هو 'أسد الله'؟",
      "answer": "حمزة بن عبد المطلب",
      "image": ""
    },
    "q42": {
      "text": "من هو الصحابي الذي شرب دم النبي ﷺ في غزوة أحد؟",
      "answer": "عبد الله بن الزبير",
      "image": ""
    },
    "q43": {
      "text": "من هو أول الخلفاء الراشدين؟",
      "answer": "أبو بكر الصديق",
      "image": ""
    },
    "q44": {
      "text": "ما هي 'الشفاعة العظمى' يوم القيامة؟",
      "answer": "شفاعة النبي محمد ﷺ لبدء الحساب",
      "image": ""
    },
    "q45": {
      "text": "ما اسم السورة التي تُسمى 'المنقذة'؟",
      "answer": "المائدة",
      "image": ""
    },
    "q46": {
      "text": "ما اسم ناقة الرسول؟",
      "answer": "القصواء",
      "image": ""
    },
    "q47": {
      "text": "من هو النبي الذي أُرسل إلى قوم عاد؟",
      "answer": "هود عليه السلام",
      "image": ""
    },
    "q48": {
      "text": "ما اسم سيف النبي ﷺ؟",
      "answer": "ذو الفقار",
      "image": ""
    },
    "q49": {
      "text": "ما السورة التي سميت باسم امرأة؟",
      "answer": "مريم",
      "image": ""
    },
    "q50": {
      "text": "من أول امرأة استشهدت في الإسلام؟",
      "answer": "سمية",
      "image": ""
    }
  },
3: {
  "q1": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'اسلام'؟",
    "answer": "الاسم",
    "image": ""
  },
  "q2": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'سلف'؟",
    "answer": "فلس",
    "image": ""
  },
  "q3": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'حاسب'؟",
    "answer": "سباح",
    "image": ""
  },
  "q4": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'برد'؟",
    "answer": "درب",
    "image": ""
  },
  "q5": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'جلس'؟",
    "answer": "سجل",
    "image": ""
  },
  "q6": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'حرب'؟",
    "answer": "بحر",
    "image": ""
  },
  "q7": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'درس'؟",
    "answer": "سرد",
    "image": ""
  },
  "q8": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'فرح'؟",
    "answer": "حرف",
    "image": ""
  },
  "q9": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'سحر'؟",
    "answer": "حرس",
    "image": ""
  },
  "q10": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'بنات'؟",
    "answer": "نبات",
    "image": ""
  },
  "q11": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'غنم'؟",
    "answer": "نغم",
    "image": ""
  },
  "q12": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'صقر'؟",
    "answer": "رقص",
    "image": ""
  },
  "q13": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'صعب'؟",
    "answer": "عصب",
    "image": ""
  },
  "q14": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'قمر'؟",
    "answer": "رمق",
    "image": ""
  },
  "q15": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'سعد'؟",
    "answer": "عدس",
    "image": ""
  },
  "q16": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'قرن'؟",
    "answer": "نقر",
    "image": ""
  },
  "q17": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'بشر'؟",
    "answer": "شبر",
    "image": ""
  },
  "q18": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'فلك'؟",
    "answer": "كلف",
    "image": ""
  },
  "q19": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'حلم'؟",
    "answer": "لمح",
    "image": ""
  },
  "q20": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'عربة'؟",
    "answer": "تبرع",
    "image": ""
  },
  "q21": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'سماء'؟",
    "answer": "مساء",
    "image": ""
  },
  "q22": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'عسل'؟",
    "answer": "سلع",
    "image": ""
  },
  "q23": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'لحم'؟",
    "answer": "محل",
    "image": ""
  },
  "q24": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'عيد'؟",
    "answer": "يعد",
    "image": ""
  },
  "q25": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'ديك'؟",
    "answer": "يدك",
    "image": ""
  },
  "q26": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'جلد'؟",
    "answer": "دجل",
    "image": ""
  },
  "q27": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'كلام'؟",
    "answer": "ملاك",
    "image": ""
  },
  "q28": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'جسد'؟",
    "answer": "سجد",
    "image": ""
  },
  "q29": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'قمر'؟",
    "answer": "مرق",
    "image": ""
  },
  "q30": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'شير'؟",
    "answer": "ريش",
    "image": ""
  },
  "q31": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'كسر'؟",
    "answer": "سكر",
    "image": ""
  },
  "q32": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'علام'؟",
    "answer": "عالم",
    "image": ""
  },
  "q33": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'لبس'؟",
    "answer": "سبل",
    "image": ""
  },
  "q34": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'لكم'؟",
    "answer": "ملك",
    "image": ""
  },
  "q35": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'هند'؟",
    "answer": "دهن",
    "image": ""
  },
  "q36": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'شارع'؟",
    "answer": "شاعر",
    "image": ""
  },
  "q37": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'مال'؟",
    "answer": "الم",
    "image": ""
  },
  "q38": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'يسار'؟",
    "answer": "ايسر",
    "image": ""
  },
  "q39": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'شوق'؟",
    "answer": "وشق",
    "image": ""
  },
  "q40": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'صقر'؟",
    "answer": "رقص",
    "image": ""
  },
  "q41": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'عدو'؟",
    "answer": "وعد",
    "image": ""
  },
  "q42": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'رقم'؟",
    "answer": "مقر",
    "image": ""
  },
  "q43": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'قوس'؟",
    "answer": "سوق",
    "image": ""
  },
  "q44": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'عرب'؟",
    "answer": "رعب",
    "image": ""
  },
  "q45": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'طبل'؟",
    "answer": "بطل",
    "image": ""
  },
  "q46": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'نمر'؟",
    "answer": "مرن",
    "image": ""
  },
  "q47": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'عنب'؟",
    "answer": "نبع",
    "image": ""
  },
  "q48": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'ورد'؟",
    "answer": "دور",
    "image": ""
  },
  "q49": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'قزم'؟",
    "answer": "مزق",
    "image": ""
  },
  "q50": {
    "text": "ما الكلمة التي تُكوّنها من حروف 'عقارب'؟",
    "answer": "عباقر",
    "image": ""
  }
},

4: {
  "q1": {
    "text": "ما هي العملة الرسمية لليابان؟",
    "answer": "الين",
    "image": ""
  },
  "q2": {
    "text": "كلمة 'merci' تابعة لأي دولة؟",
    "answer": "فرنسا",
    "image": ""
  },
  "q3": {
    "text": "ما هي عملة الهند؟",
    "answer": "الروبية الهندية",
    "image": ""
  },
  "q4": {
    "text": "كلمة 'hola' من أي لغة؟",
    "answer": "إسبانيا",
    "image": ""
  },
  "q5": {
    "text": "ما العملة المستخدمة في البرازيل؟",
    "answer": "الريال البرازيلي",
    "image": ""
  },
  "q6": {
    "text": "كلمة 'danke' مرتبطة بأي دولة؟",
    "answer": "ألمانيا",
    "image": ""
  },
  "q7": {
    "text": "ما هي عملة روسيا؟",
    "answer": "الروبل الروسي",
    "image": ""
  },
  "q8": {
    "text": "كلمة 'köszönöm' من أي لغة؟",
    "answer": "المجر",
    "image": ""
  },
  "q9": {
    "text": "ما العملة الرسمية لمصر؟",
    "answer": "الجنيه المصري",
    "image": ""
  },
  "q10": {
    "text": "كلمة 'salam' تُستخدم في أي دولة؟",
    "answer": "إيران",
    "image": ""
  },
  "q11": {
    "text": "ما هي عملة كوريا الجنوبية؟",
    "answer": "الوون الكوري الجنوبي",
    "image": ""
  },
  "q12": {
    "text": "كلمة 'namaste' تابعة لأي دولة؟",
    "answer": "الهند",
    "image": ""
  },
  "q13": {
    "text": "ما العملة المستخدمة في كندا؟",
    "answer": "الدولار الكندي",
    "image": ""
  },
  "q14": {
    "text": "كلمة 'ciao' من أي لغة؟",
    "answer": "إيطاليا",
    "image": ""
  },
  "q15": {
    "text": "ما هي عملة تركيا؟",
    "answer": "الليرة التركية",
    "image": ""
  },
  "q16": {
    "text": "كلمة 'arigato' تابعة لأي دولة؟",
    "answer": "اليابان",
    "image": ""
  },
  "q17": {
    "text": "ما العملة الرسمية للسعودية؟",
    "answer": "الريال السعودي",
    "image": ""
  },
  "q18": {
    "text": "كلمة 'salamat' من أي لغة؟",
    "answer": "الفلبين",
    "image": ""
  },
  "q19": {
    "text": "ما هي عملة سويسرا؟",
    "answer": "الفرنك السويسري",
    "image": ""
  },
  "q20": {
    "text": "كلمة 'grazie' مرتبطة بأي دولة؟",
    "answer": "إيطاليا",
    "image": ""
  },
  "q21": {
    "text": "ما العملة المستخدمة في جنوب إفريقيا؟",
    "answer": "الراند الجنوب أفريقي",
    "image": ""
  },
  "q22": {
    "text": "كلمة 'shukran' من أي لغة؟",
    "answer": "المغرب",
    "image": ""
  },
  "q23": {
    "text": "ما هي عملة الأرجنتين؟",
    "answer": "البيسو الأرجنتيني",
    "image": ""
  },
  "q24": {
    "text": "كلمة 'sawasdee' تابعة لأي دولة؟",
    "answer": "تايلاند",
    "image": ""
  },
  "q25": {
    "text": "ما العملة الرسمية لإندونيسيا؟",
    "answer": "الروبية الإندونيسية",
    "image": ""
  },
  "q26": {
    "text": "كلمة 'halo' من أي لغة؟",
    "answer": "إندونيسيا",
    "image": ""
  },
  "q27": {
    "text": "ما هي عملة النرويج؟",
    "answer": "الكرونة النرويجية",
    "image": ""
  },
  "q28": {
    "text": "كلمة 'kamusta' تابعة لأي دولة؟",
    "answer": "الفلبين",
    "image": ""
  },
  "q29": {
    "text": "ما العملة المستخدمة في تايلاند؟",
    "answer": "الباهت التايلاندي",
    "image": ""
  },
  "q30": {
    "text": "كلمة 'ni hao' من أي لغة؟",
    "answer": "الصين",
    "image": ""
  },
  "q31": {
    "text": "ما هي عملة السويد؟",
    "answer": "الكرونا السويدية",
    "image": ""
  },
  "q32": {
    "text": "كلمة 'bonjour' تابعة لأي دولة؟",
    "answer": "فرنسا",
    "image": ""
  },
  "q33": {
    "text": "ما العملة الرسمية لليونان؟",
    "answer": "اليورو",
    "image": ""
  },
  "q34": {
    "text": "كلمة 'privet' من أي لغة؟",
    "answer": "روسيا",
    "image": ""
  },
  "q35": {
    "text": "ما هي عملة المكسيك؟",
    "answer": "البيسو المكسيكي",
    "image": ""
  },
  "q36": {
    "text": "كلمة 'hvala' تابعة لأي دولة؟",
    "answer": "كرواتيا",
    "image": ""
  },
  "q37": {
    "text": "ما العملة المستخدمة في بولندا؟",
    "answer": "الزلوتي البولندي",
    "image": ""
  },
  "q38": {
    "text": "كلمة 'dziekuje' من أي لغة؟",
    "answer": "بولندا",
    "image": ""
  },
  "q39": {
    "text": "ما هي عملة التشيك؟",
    "answer": "الكرونة التشيكية",
    "image": ""
  },
  "q40": {
    "text": "كلمة 'obrigado' تابعة لأي دولة؟",
    "answer": "البرتغال",
    "image": ""
  },
  "q41": {
    "text": "ما العملة الرسمية لتركمانستان؟",
    "answer": "المانات التركمانية",
    "image": ""
  },
  "q42": {
    "text": "كلمة 'merhaba' من أي لغة؟",
    "answer": "التركية",
    "image": ""
  },
  "q43": {
    "text": "ما هي عملة فيتنام؟",
    "answer": "الدونغ الفيتنامي",
    "image": ""
  },
  "q44": {
    "text": "كلمة 'xin chào' تابعة لأي دولة؟",
    "answer": "فيتنام",
    "image": ""
  },
  "q45": {
    "text": "ما العملة المستخدمة في كوبا؟",
    "answer": "البيسو الكوبي",
    "image": ""
  },
  "q46": {
    "text": "كلمة 'gracias' من أي لغة؟",
    "answer": "إسبانيا",
    "image": ""
  },
  "q47": {
    "text": "ما هي عملة أوكرانيا؟",
    "answer": "الهريفنيا الأوكرانية",
    "image": ""
  },
  "q48": {
    "text": "كلمة 'dziękuję' من أي لغة؟",
    "answer": "بولندا",
    "image": ""
  },
  "q49": {
    "text": "ما العملة الرسمية لنيوزيلندا؟",
    "answer": "الدولار النيوزيلندي",
    "image": ""
  },
  "q50": {
    "text": "كلمة 'kia ora' من أي لغة؟",
    "answer": "نيوزيلندا",
    "image": ""
  }
},

5: {
  "q1": {
    text: "خمن التلميح المشترك بين (سيف + مسدس + صاروخ)؟",
    answer: "اسلحة",
    image: ""
  },
  "q2": {
    text: "خمن التلميح المشترك بين (جدار + سور)؟",
    answer: "حاجز",
    image: ""
  },
  "q3": {
    text: "خمن التلميح المشترك بين (سيارة + سفينة + طائرة)؟",
    answer: "مواصلات",
    image: ""
  },
  "q4": {
    text: "خمن التلميح المشترك بين (كرسي + طاولة + سرير)؟",
    answer: "غرفة",
    image: ""
  },
  "q5": {
    text: "خمن التلميح المشترك بين (رصاص + مدفع + رمح)؟",
    answer: "ذخيرة",
    image: ""
  },
  "q6": {
    text: "خمن التلميح المشترك بين (مكتبة + كتاب + بحث)؟",
    answer: "معرفة",
    image: ""
  },
  "q7": {
    text: "خمن التلميح المشترك بين (مضرب + كرة + ملعب)؟",
    answer: "رياضة",
    image: ""
  },
  "q8": {
    text: "خمن التلميح المشترك بين (سكين + شفرة + خنجر)؟",
    answer: "أدوات ",
    image: ""
  },
  "q9": {
    text: "خمن التلميح المشترك بين (ميدالية + كأس + جائزة)؟",
    answer: "تكريم",
    image: ""
  },
  "q10": {
    text: "خمن التلميح المشترك بين (مغناطيس + معدن + حديد)؟",
    answer: "تجاذب",
    image: ""
  },
  "q11": {
    text: "خمن التلميح المشترك بين (غابة + شجرة + زهرة)؟",
    answer: "نباتات",
    image: ""
  },
  "q12": {
    text: "خمن التلميح المشترك بين (ثعبان + تمساح + سحلية)؟",
    answer: "زواحف",
    image: ""
  },
  "q13": {
    text: "خمن التلميح المشترك بين (فضاء + نجم + كوكب)؟",
    answer: "كون",
    image: ""
  },
  "q14": {
    text: "خمن التلميح المشترك بين (خمنء + ثلج + بخار)؟",
    answer: "سوائل",
    image: ""
  },
  "q15": {
    text: "خمن التلميح المشترك بين (قهوة + عصير)؟",
    answer: "مشروبات",
    image: ""
  },
  "q16": {
    text: "خمن التلميح المشترك بين (بحر + نهر  )؟",
    answer: "الماء",
    image: ""
  },
  "q17": {
    text: "خمن التلميح المشترك بين ( دخان + ولاعة)؟",
    answer: "نار",
    image: ""
  },
  "q18": {
    text: "خمن التلميح المشترك بين (بطيخ + ثلاجة + ملعقة )؟",
    answer: "مطبخ",
    image: ""
  },
  "q19": {
    text: "خمن التلميح المشترك بين (مخطط + مرور + غيار)؟",
    answer: "شارع",
    image: ""
  },
  "q20": {
    text: "خمن التلميح المشترك بين (مدرسة + جامعة + خط)؟",
    answer: "ورقة",
    image: ""
  },
  "q21": {
    text: "خمن التلميح المشترك بين (مطر + ريح + برق)؟",
    answer: "طقس",
    image: ""
  },
  "q22": {
    text: "خمن التلميح المشترك بين (ذهب + الخمنس + زئبق)؟",
    answer: "معادن",
    image: ""
  },
  "q23": {
    text: "خمن التلميح المشترك بين (سكر + ملح + فلفل)؟",
    answer: "توابل",
    image: ""
  },
  "q24": {
    text: "خمن التلميح المشترك بين (سيارة + دراجة + قطار)؟",
    answer: "مركبات",
    image: ""
  },
  "q25": {
    text: "خمن التلميح المشترك بين (عسل + قشطة + تمر)؟",
    answer: "فطور ",
    image: ""
  },
  "q26": {
    text: "خمن التلميح المشترك بين (طبيب + حبوب + مستشفى)؟",
    answer: "علاج",
    image: ""
  },
  "q27": {
    text: "خمن التلميح المشترك بين (شمس + قمر + نجمة)؟",
    answer: " سماء",
    image: ""
  },
  "q28": {
    text: "خمن التلميح المشترك بين (نار + حريق + كبريت)؟",
    answer: "اشتعال",
    image: ""
  },
  "q29": {
    text: "خمن التلميح المشترك بين (سمكة + قرش + حوت)؟",
    answer: "بحر",
    image: ""
  },
  "q30": {
    text: "خمن التلميح المشترك بين (تفاح + موز + فراولة)؟",
    answer: "فواكه",
    image: ""
  },
  "q31": {
    text: "خمن التلميح المشترك بين (قلم + دفتر + كتابة)؟",
    answer: " مسطرة",
    image: ""
  },
  "q32": {
    text: "خمن التلميح المشترك بين (باب + شباك + سيارة)؟",
    answer: "قفل",
    image: ""
  },
  "q33": {
    text: "خمن التلميح المشترك بين (طائرة + خفيفة )؟",
    answer: "ورقية",
    image: ""
  },
  "q34": {
    text: "خمن التلميح المشترك بين (زر + قميص + بنطلون)؟",
    answer: "ملابس",
    image: ""
  },
  "q35": {
    text: "خمن التلميح المشترك بين (كرة + مضرب + ملعب)؟",
    answer: "تنس",
    image: ""
  },
  "q36": {
    text: "خمن التلميح المشترك بين (ساعة + يوم + شهر)؟",
    answer: " زمن",
    image: ""
  },
  "q37": {
    text: "خمن التلميح المشترك بين (وردة + زهرة + عشب)؟",
    answer: "نباتات",
    image: ""
  },
  "q38": {
    text: "خمن التلميح المشترك بين (قهوة + سواليف + دلة)؟",
    answer: " مجلس",
    image: ""
  },
  "q39": {
    text: "خمن التلميح المشترك بين (حصان + بقرة + خروف)؟",
    answer: "حيوانات ",
    image: ""
  },
  "q40": {
    text: "خمن التلميح المشترك بين (جبل + وادي + سهول)؟",
    answer: "تضاريس",
    image: ""
  },
  "q41": {
    text: "خمن التلميح المشترك بين (مطرقة + مفك + تصليح)؟",
    answer: " سباكة",
    image: ""
  },
  "q42": {
    text: "خمن التلميح المشترك بين (شمس + ضوء + مصباح)؟",
    answer: "إضاءة",
    image: ""
  },
  "q43": {
    text: "خمن التلميح المشترك بين (سكر + دقيق + ملح)؟",
    answer: "مكونات ",
    image: ""
  },
  "q44": {
    text: "خمن التلميح المشترك بين (عين + أذن + أنف)؟",
    answer: "أعضاء ",
    image: ""
  },
  "q45": {
    text: "خمن التلميح المشترك بين (طيارة + ريح + دراجة)؟",
    answer: "هوائية ",
    image: ""
  },
  "q46": {
    text: "خمن التلميح المشترك بين (تفاح + برتقال + عنب)؟",
    answer: "عصير",
    image: ""
  },
  "q47": {
    text: "خمن التلميح المشترك بين (بحر + صحراء + جبل)؟",
    answer: " مناظر",
    image: ""
  },
  "q48": {
    text: "خمن التلميح المشترك بين (كتاب + قصة + رواية)؟",
    answer: "أدب",
    image: ""
  },
  "q49": {
    text: "خمن التلميح المشترك بين (نار + دخان + شمعة)؟",
    answer: "احتراق",
    image: ""
  },
  "q50": {
    text: "خمن التلميح المشترك بين (مطر + سحاب + برق)؟",
    answer: " اجواء",
    image: ""
  }
},

  
  6: {
    "q1": {
      "text": "ما هو أسرع حيوان بري على وجه الأرض؟",
      "answer": "الفهد",
      "image": ""
    },
    "q2": {
      "text": "ما هو العنصر الكيميائي الذي رمزه 'Au'؟",
      "answer": "الذهب",
      "image": ""
    },
    "q3": {
      "text": "ما اسم العملية التي تُنتج فيها النباتات الغذاء باستخدام الضوء؟",
      "answer": "التركيب الضوئي",
      "image": ""
    },
    "q4": {
      "text": "ما هو الكوكب الأقرب إلى الشمس؟",
      "answer": "عطارد",
      "image": ""
    },
    "q5": {
      "text": "ما هو أكبر حيوان بري يعيش على الأرض؟",
      "answer": "الفيل",
      "image": ""
    },
    "q6": {
      "text": "ما هو العضو البشري المسؤول عن تنظيم مستوى السكر في الدم؟",
      "answer": "البنكرياس",
      "image": ""
    },
    "q7": {
      "text": "ما هو الحيوان الذي يمتلك أطول رقبة؟",
      "answer": "الزرافة",
      "image": ""
    },
    "q8": {
      "text": "ما هو الحيوان البحري الذي يتميز بأذرع طويلة؟",
      "answer": "الأخطبوط",
      "image": ""
    },
    "q9": {
      "text": "ما هو المعدن السائل في درجة حرارة الغرفة؟",
      "answer": "الزئبق",
      "image": ""
    },
    "q10": {
      "text": "ما هي أصغر عظمة في جسم الإنسان؟",
      "answer": "عظمة الركاب (في الأذن)",
      "image": ""
    },
    "q11": {
      "text": "ما هو الحيوان الذي يعتبر أكبر الثدييات البحرية؟",
      "answer": "الحوت الأزرق",
      "image": ""
    },
    "q12": {
      "text": "ما هو الحيوان الذي يُعرف بلقب 'ملك الغابة'؟",
      "answer": "الأسد",
      "image": ""
    },
    "q13": {
      "text": "ما اسم الجزء المسؤول عن الذاكرة في الدماغ؟",
      "answer": "الحُصين",
      "image": ""
    },
    "q14": {
      "text": "ما هي أشد أنواع أشعة الطاقة في الطيف الكهرومغناطيسي؟",
      "answer": "أشعة جاما",
      "image": ""
    },
    "q15": {
      "text": "ما هو العنصر الذي يحتوي على العدد الذري 1؟",
      "answer": "الهيدروجين",
      "image": ""
    },
    "q16": {
      "text": "ما هو الكوكب الذي يُطلق عليه 'الكوكب الأحمر'؟",
      "answer": "المريخ",
      "image": ""
    },
    "q17": {
      "text": "ما هو الحيوان الذي يستطيع القفز لمسافات طويلة بالنسبة لحجمه؟",
      "answer": "الكنغر",
      "image": ""
    },
    "q18": {
      "text": "ما هو اسم أصغر جزء في المادة يمكن أن يدخل في تفاعل كيميائي؟",
      "answer": "الذرة",
      "image": ""
    },
    "q19": {
      "text": "ما هو الحيوان الذي يعتبر من أذكى الحيوانات على وجه الأرض؟",
      "answer": "الدلفين",
      "image": ""
    },
    "q20": {
      "text": "ما هو القانون الفيزيائي الذي ينص على أن 'القوة تساوي الكتلة × التسارع'؟",
      "answer": "قانون نيوتن الثاني",
      "image": ""
    },
    "q21": {
      "text": "ما هي العملية التي تُطلق الطاقة من الجلوكوز في الخلايا؟",
      "answer": "التنفس الخلوي",
      "image": ""
    },
    "q22": {
      "text": "ما هو اسم الظاهرة التي تسبب انحناء الضوء عند عبوره وسطًا شفافًا؟",
      "answer": "الانكسار",
      "image": ""
    },
    "q23": {
      "text": "ما هو العنصر الأكثر وفرة في القشرة الأرضية؟",
      "answer": "الأكسجين",
      "image": ""
    },
    "q24": {
      "text": "ما هو الكوكب الوحيد الذي يدور بعكس اتجاه دوران الكواكب الأخرى؟",
      "answer": "الزهرة",
      "image": ""
    },
    "q25": {
      "text": "ما هي المادة الوراثية في الفيروسات التي تصيب البكتيريا؟",
      "answer": "DNA أو RNA",
      "image": ""
    },
    "q26": {
      "text": "ما هي وحدة قياس شدة التيار الكهربائي؟",
      "answer": "الأمبير",
      "image": ""
    },
    "q27": {
      "text": "ما هو العنصر الكيميائي الذي يُستخدم في تصنيع رقائق الحواسيب؟",
      "answer": "السيليكون",
      "image": ""
    },
    "q28": {
      "text": "ما هو اسم المجرة التي نعيش فيها؟",
      "answer": "درب التبانة",
      "image": ""
    },
    "q29": {
      "text": "ما هو الغاز الذي يُشكل حوالي 78% من غلاف الأرض الجوي؟",
      "answer": "النتروجين",
      "image": ""
    },
    "q30": {
      "text": "ما هو الحيوان الذي يُعرف بسرعته في الطيران؟",
      "answer": "الصقر",
      "image": ""
    },
    "q31": {
      "text": "ما هو اسم القوة التي تقاوم الحركة بين سطحين متلامسين؟",
      "answer": "قوة الاحتكاك",
      "image": ""
    },
    "q32": {
      "text": "ما هو الحيوان الذي يمتلك أقوى عضلات في جسمه؟",
      "answer": "الغوريلا",
      "image": ""
    },
    "q33": {
      "text": "ما هو الكوكب الأكبر في المجموعة الشمسية؟",
      "answer": "المشتري",
      "image": ""
    },
    "q34": {
      "text": "ما هو الحيوان الذي يعيش في المياه المالحة ويملك درعاً من العظام؟",
      "answer": "سلحفاة البحر",
      "image": ""
    },
    "q35": {
      "text": "ما هو الحيوان الذي يُعتبر أكبر الزواحف على وجه الأرض؟",
      "answer": "التمساح الملحي",
      "image": ""
    },
    "q36": {
      "text": "ما هو اسم المركبات العضوية التي تتكون من الكربون والهيدروجين فقط؟",
      "answer": "الهيدروكربونات",
      "image": ""
    },
    "q37": {
      "text": "ما هو الحيوان الذي يمتلك أطول فترة حمل؟",
      "answer": "الفيل",
      "image": ""
    },
    "q38": {
      "text": "ما هو اسم الطبقة الخارجية للجلد؟",
      "answer": "البشرة",
      "image": ""
    },
    "q39": {
      "text": "ما هو العنصر الذي يُستخدم في صناعة البطاريات الجافة؟",
      "answer": "الزنك",
      "image": ""
    },
    "q40": {
      "text": "ما هو الحيوان الذي يستطيع تغيير لونه ليتماشى مع محيطه؟",
      "answer": "الحرباء",
      "image": ""
    },
    "q41": {
      "text": "ما هو الحيوان الذي يمتلك قدرة على السباحة في أعماق البحار؟",
      "answer": "الحوت ",
      "image": ""
    },
    "q42": {
      "text": "ما هو اسم القانون الذي ينص على أن 'الضغط × الحجم = ثابت' عند درجة حرارة ثابتة؟",
      "answer": "قانون بويل",
      "image": ""
    },
    "q43": {
      "text": "ما هو العنصر الذي يُستخدم في صناعة الأسلاك الكهربائية؟",
      "answer": "النحاس",
      "image": ""
    },
    "q44": {
      "text": "ما هو الحيوان الذي يستخدم الحاسة المغناطيسية للملاحة؟",
      "answer": "السلاحف البحرية",
      "image": ""
    },
    "q45": {
      "text": "ما هو الحيوان الذي يستطيع البقاء بدون ماء لفترات طويلة؟",
      "answer": "الجمل",
      "image": ""
    },
    "q46": {
      "text": "ما هو الحيوان الذي يُعرف بقدرته على تغيير لونه بسرعة لتجنب المفترسين؟",
      "answer": "الحبار",
      "image": ""
    },
    "q47": {
      "text": "ما هي الطاقة المخزنة في نواة الذرة؟",
      "answer": "الطاقة النووية",
      "image": ""
    },
    "q48": {
      "text": "ما هو الحيوان الذي يستطيع العيش في البيئات القطبية القاسية؟",
      "answer": "الدب القطبي",
      "image": ""
    },
    "q49": {
      "text": "ما هو العنصر الذي يُشكل حوالي 21% من غلاف الأرض الجوي؟",
      "answer": "الأكسجين",
      "image": ""
    },
    "q50": {
      "text": "ما هو الحيوان الذي يمتلك حاسة سمع فائقة تمكنه من الصيد في الظلام؟",
      "answer": "الخفاش",
      "image": ""
    }
  },
  

  7: {
    "q1": {
      "text": "ا ئ ر ة ط ر ق ي ة و",
      "answer": "طائرة ورقية",
      "image": ""
    },
    "q2": {
      "text": "ا عة س م ل ي ة ر",
      "answer": "ساعة رملية",
      "image": ""
    },
    "q3": {
      "text": "ا ت ف ه ح م و ل م",
      "answer": "هاتف محمول",
      "image": ""
    },
    "q4": {
      "text": "ي ا ر ة س ",
      "answer": "سيارة ",
      "image": ""
    },
    "q5": {
      "text": "ه و ة ق ر ب ي ة ع",
      "answer": "قهوة عربية",
      "image": ""
    },
    "q6": {
      "text": "ا ف ص ي ل",
      "answer": " الصيف",
      "image": ""
    },
    "q7": {
      "text": "ت ا ب ك ف ت و ح م",
      "answer": "كتاب مفتوح",
      "image": ""
    },
    "q8": {
      "text": "ل م ق ب ر ح",
      "answer": "قلم حبر",
      "image": ""
    },
    "q9": {
      "text": "ر ق ة و ي ض ا ء ب",
      "answer": "ورقة بيضاء",
      "image": ""
    },
    "q10": {
      "text": "د ي ن ة م ب ي ر ة ك",
      "answer": "مدينة كبيرة",
      "image": ""
    },
    "q11": {
      "text": "د ي ق ة ح ا م ة ع",
      "answer": "حديقة عامة",
      "image": ""
    },
    "q12": {
      "text": "ك ت ب م ظ ي ف ن",
      "answer": "مكتب نظيف",
      "image": ""
    },
    "q13": {
      "text": "ا و ل ة ط س ت د ي ر ة م",
      "answer": "طاولة مستديرة",
      "image": ""
    },
    "q14": {
      "text": "ر س ي ك ر ي ح م",
      "answer": "كرسي مريح",
      "image": ""
    },
    "q15": {
      "text": "ا ب ب ف ت و ح م",
      "answer": "باب مفتوح",
      "image": ""
    },
    "q16": {
      "text": "ا ف ذ ة ن ج ا ج ي ة ز",
      "answer": "نافذة زجاجية",
      "image": ""
    },
    "q17": {
      "text": "د ا ر ج ب ي ض أ",
      "answer": "جدار أبيض",
      "image": ""
    },
    "q18": {
      "text": "ق ف س ر ت ف ع م",
      "answer": "سقف مرتفع",
      "image": ""
    },
    "q19": {
      "text": "ا ر ع ش ا د ئ ه",
      "answer": "شارع هادئ",
      "image": ""
    },
    "q20": {
      "text": "ه ر ن ",
      "answer": "نهر ",
      "image": ""
    },
    "q21": {
      "text": "ح ر ب ا ئ ج ه",
      "answer": "بحر هائج",
      "image": ""
    },
    "q22": {
      "text": "ب ا ل ج ",
      "answer": "جبال ",
      "image": ""
    },
    "q23": {
      "text": "ا د ي و",
      "answer": "وادي ",
      "image": ""
    },
    "q24": {
      "text": "م ر ق ك ت م ل م",
      "answer": "قمر مكتمل",
      "image": ""
    },
    "q25": {
      "text": "م س ش ش ر ق ة م",
      "answer": "شمس مشرقة",
      "image": ""
    },
    "q26": {
      "text": "م ا ء س ا ف ي ة ص",
      "answer": "سماء صافية",
      "image": ""
    },
    "q27": {
      "text": "ج و م ن ا م ع ة ل",
      "answer": "نجوم لامعة",
      "image": ""
    },
    "q28": {
      "text": "ه و ر ز م ي ل ة ج",
      "answer": "زهور جميلة",
      "image": ""
    },
    "q29": {
      "text": "د و د ح ",
      "answer": "حدود ",
      "image": ""
    },
    "q30": {
      "text": "ا ب ب غ ل ق م",
      "answer": "باب مغلق",
      "image": ""
    },
    "q31": {
      "text": "ر ك ي س ش ب ي خ",
      "answer": "كرسي خشبي",
      "image": ""
    },
    "q32": {
      "text": "ر ف ة غ و م ن",
      "answer": "غرفة نوم",
      "image": ""
    },
    "q33": {
      "text": "ط ب خ م ي ب ر ع",
      "answer": "مطبخ عربي",
      "image": ""
    },
    "q34": {
      "text": " ا م ة ح م",
      "answer": "حمامة",
      "image": ""
    },
    "q35": {
      "text": "د ي ق ة ح ن ز ل ي ة م",
      "answer": "حديقة منزلية",
      "image": ""
    },
    "q36": {
      "text": "س ب ح م ب ي ر ك",
      "answer": "مسبح كبير",
      "image": ""
    },
    "q37": {
      "text": "ل ع ب م و ر ة ك",
      "answer": "ملعب كورة",
      "image": ""
    },
    "q38": {
      "text": "س ة م د ر",
      "answer": "مدرسة ",
      "image": ""
    },
    "q39": {
      "text": "ا م ع ة ج ش ه و ر ة م",
      "answer": "جامعة مشهورة",
      "image": ""
    },
    "q40": {
      "text": "ا ر ع ش ئ ي س ي ر",
      "answer": "شارع رئيسي",
      "image": ""
    },
    "q41": {
      "text": "ي ا ر ة س ي ا ض ي ة ر",
      "answer": "سيارة رياضية",
      "image": ""
    },
    "q42": {
      "text": "ر ك ب ة م ق ي ل ة ث",
      "answer": "مركبة ثقيلة",
      "image": ""
    },
    "q43": {
      "text": "ف ي ن ة س م ل ا ق ة ع",
      "answer": "سفينة عملاقة",
      "image": ""
    },
    "q44": {
      "text": "ط ا ر ق ل ا ر ي ل ع ا س",
      "answer": "القطار السريع",
      "image": ""
    },
    "q45": {
      "text": "ت ا ب ك ي م ق",
      "answer": "كتاب قيم",
      "image": ""
    },
    "q46": {
      "text": "ا ج ل م ع ة ا",
      "answer": "الجامعة",
      "image": ""
    },
    "q47": {
      "text": "ف ا ش ي ل م ن ك",
      "answer": "فيلم اكشن",
      "image": ""
    },
    "q48": {
      "text": "غ ن ي ة أ ع ب ي ة ش",
      "answer": "أغنية شعبية",
      "image": ""
    },
    "q49": {
      "text": "و ح ة ل ن ي ة ف",
      "answer": "لوحة فنية",
      "image": ""
    },
    "q50": {
      "text": "ظ ا ر ة ن م س ي ة ش",
      "answer": "نظارة شمسية",
      "image": ""
    }
  },


  8: {
    "q1": {
      text: "ما مرادف كلمة (سَخِي)؟",
      answer: "كريم / جواد",
      image: ""
    },
    "q2": {
      text: "ما مرادف كلمة (حَزِنَ)؟",
      answer: "تألم / اغتم",
      image: ""
    },
    "q3": {
      text: "ما مرادف كلمة (الضَّوْء)؟",
      answer: "النور",
      image: ""
    },
    "q4": {
      text: "ما مرادف كلمة (الفَضَاء)؟",
      answer: "الكون",
      image: ""
    },
    "q5": {
      text: "ما مرادف كلمة (العِلْم)؟",
      answer: "المعرفة",
      image: ""
    },
    "q6": {
      text: "ما ضد كلمة (الجَلَادَة)؟",
      answer: "اللِّين",
      image: ""
    },
    "q7": {
      text: "ما ضد كلمة (الضِّياء)؟",
      answer: "الغَسَق",
      image: ""
    },
    "q8": {
      text: "ما مرادف كلمة (الصَّبُور)؟",
      answer: "الحليم",
      image: ""
    },
    "q9": {
      text: "ما مرادف كلمة (القَدِيم)؟",
      answer: "العتيق",
      image: ""
    },
    "q10": {
      text: "ما مرادف كلمة (الغَضَب)؟",
      answer: "السخط",
      image: ""
    },
    "q11": {
      text: "ما مرادف كلمة (الذَّكِي)؟",
      answer: "الفَطِن",
      image: ""
    },
    "q12": {
      text: "ما مرادف كلمة (الخَوْف)؟",
      answer: "الرَّهبة",
      image: ""
    },
    "q13": {
      text: "ما مرادف كلمة (الصَّدِيق)؟",
      answer: "الرَّفيق",
      image: ""
    },
    "q14": {
      text: "ما مرادف كلمة (الحَقِيقَة)؟",
      answer: "الوَاقِع",
      image: ""
    },
    "q15": {
      text: "ما مرادف كلمة (البَصِير)؟",
      answer: "النَّاظِر",
      image: ""
    },
    "q16": {
      text: "ما مرادف كلمة (الأَمَل)؟",
      answer: "الرَّجاء",
      image: ""
    },
    "q17": {
      text: "ما مرادف كلمة (الغِنَى)؟",
      answer: "الثَّراء",
      image: ""
    },
    "q18": {
      text: "ما مرادف كلمة (القَلِق)؟",
      answer: "مُضْطَرِب",
      image: ""
    },
    "q19": {
      text: "ما مرادف كلمة (السَّعِيد)؟",
      answer: "الفَرْحَان",
      image: ""
    },
    "q20": {
      text: "ما مرادف كلمة (القَصِيدَة)؟",
      answer: "الشِّعر",
      image: ""
    },
    "q21": {
      text: "ما مرادف كلمة (الجَمَال)؟",
      answer: "الحُسْن",
      image: ""
    },
    "q22": {
      text: "ما مرادف كلمة (الصَّمْت)؟",
      answer: "السُّكوت",
      image: ""
    },
    "q23": {
      text: "ما مرادف كلمة (البَطَل)؟",
      answer: "الفَارِس",
      image: ""
    },
    "q24": {
      text: "ما مرادف كلمة (الضَّعِيف)؟",
      answer: "الهَزيل",
      image: ""
    },
    "q25": {
      text: "ما مرادف كلمة (الغَامِض)؟",
      answer: "المُبْهَم",
      image: ""
    },
    "q26": {
      text: "ما ضد كلمة (النَّجَاح)؟",
      answer: "الفَشَل",
      image: ""
    },
    "q27": {
      text: "ما ضد كلمة (الصَّبُور)؟",
      answer: "العَجُول",
      image: ""
    },
    "q28": {
      text: "ما ضد كلمة (الحُب)؟",
      answer: "الكُرْه",
      image: ""
    },
    "q29": {
      text: "ما ضد كلمة (الظَّلام)؟",
      answer: "النُّور",
      image: ""
    },
    "q30": {
      text: "ما ضد كلمة (القُوَّة)؟",
      answer: "الضَّعْف",
      image: ""
    },
    "q31": {
      text: "ما ضد كلمة (الكَرَم)؟",
      answer: "البُخْل",
      image: ""
    },
    "q32": {
      text: "ما ضد كلمة (الضَّحِك)؟",
      answer: "البُكاء",
      image: ""
    },
    "q33": {
      text: "ما ضد كلمة (الصَّغِير)؟",
      answer: "الكَبِير",
      image: ""
    },
    "q34": {
      text: "ما ضد كلمة (السَّهْل)؟",
      answer: "الصَّعْب",
      image: ""
    },
    "q35": {
      text: "ما ضد كلمة (الحَيَاة)؟",
      answer: "المَوْت",
      image: ""
    },
    "q36": {
      text: "ما ضد كلمة (الفَرَح)؟",
      answer: "الحُزْن",
      image: ""
    },
    "q37": {
      text: "ما ضد كلمة (الرِّضَا)؟",
      answer: "السَّخَط",
      image: ""
    },
    "q38": {
      text: "ما ضد كلمة (الاِتِّفَاق)؟",
      answer: "الخِلاف",
      image: ""
    },
    "q39": {
      text: "ما ضد كلمة (الجَزَر)؟",
      answer: "المَدّ",
      image: ""
    },
    "q40": {
      text: "ما ضد كلمة (الاِنْتِصَار)؟",
      answer: "الهَزِيمَة",
      image: ""
    },
    "q41": {
      text: "ما ضد كلمة (الاِسْتِيقَاظ)؟",
      answer: "النَّوْم",
      image: ""
    },
    "q42": {
      text: "ما ضد كلمة (التَّكَاثُف)؟",
      answer: "التَّخَلْخُل",
      image: ""
    },
    "q43": {
      text: "ما ضد كلمة (الاِزْدِحَام)؟",
      answer: "الفَرَاغ",
      image: ""
    },
    "q44": {
      text: "ما ضد كلمة (الاِسْتِحْسَان)؟",
      answer: "الاِسْتِهْجَان",
      image: ""
    },
    "q45": {
      text: "ما ضد كلمة (التَّرَاكُم)؟",
      answer: "التَّنَاقُص",
      image: ""
    },
    "q46": {
      text: "ما ضد كلمة (التَّوَاتُر)؟",
      answer: "التَّقَطُّع",
      image: ""
    },
    "q47": {
      text: "ما ضد كلمة (الاِسْتِقْصَاء)؟",
      answer: "الاِغْفَال",
      image: ""
    },
    "q49": {
      text: "ما ضد كلمة (التَّجَانُس)؟",
      answer: "التَّبَايُن",
      image: ""
    },
    "q49": {
      text: "ما ضد كلمة (الاِنْفِتَاح)؟",
      answer: "الاِنْغِلاق",
      image: ""
    },
    "q50": {
      text: "ما ضد كلمة (الاِسْتِقَامَة)؟",
      answer: "الاِنْحِراف",
      image: ""
    }
  },

  9: {
    "q1": {
      text: "شيء يفيدك عندما تأكله ولكنه يقتلك عندما تأكل منه نصفه",
      answer: "السمسم",
      image: ""
    },
    "q2": {
      text: "شيء موجود في السماء إذا أضفت إليه حرفا أصبح في الأرض؟",
      answer: "نجم - منجم",
      image: ""
    },
    "q3": {
    "text": "اسم رجل من أربع حروف إذا عكسته أصبح اسم بنت، وأول حرفين أداة استفهام، وآخر حرفين اسم حيوان، وإذا حذفت حرفًا معينًا أصبح شرطًا من شروط الزواج. ما هو الاسم؟",
    "answer": "ماهر",
    "image": ""
  },
    "q4": {
      text: "ما هو الشي الذي ينبض بلا قلب؟",
      answer: "الساعة",
      image: ""
    },
    "q5": {
      text: "ما هو الشيء الذي يتحدث جميع لغات العالم؟",
      answer: "الصدى",
      image: ""
    },
    "q6": {
      text: "عدد يقبل القسمة على 2,3,4,5,6 وعند القسمة في كل مرة يتبقى واحد، ما هو العدد؟",
      answer: "61",
      image: ""
    },
    "q7": {
      text: "شي تقدر تمسكه بس ما تقدر تلمسه؟",
      answer: "الاعصاب",
      image: ""
    },
    "q8": {
      text: "(موكب الامير تحت الجسر) - اضف حرف واحد ليصبح فوق الجسر",
      answer: "الهاء = تحته",
      image: ""
    },
    "q9": {
      text: "كيف يكون اتجاه دخان القطار الكهربائي اذا كانت الرياح آتيه من الشرق؟",
      answer: "القطار الكهربائي ليس له دخان",
      image: ""
    },
    "q10": {
      text: "ما هو الشيء الذي يُولد قبل أن يُفكر فيه، ويُفكر فيه بعد أن يموت، ويظل حيًا طالما لم يُولد، ويموت بمجرد أن يُعاش؟",
      answer: "الحلم",
      image: ""
    },
    "q11": {
      text: "ابنشدك عن بنت بها السم مدفون ويا كثـر مـافي بطنـها من مصايب الاسم سته حروف والراس مسموم  يحتاجهـا الكل طـفـل وشايـب  اول ثلاثة حروف بها الناس يشقون واخر ثلاثه حروف حق وطـلايـب",
      answer: "صيدليه",
      image: ""
    },
    "q12": {
      text: "أخف من الريشة ولكن لا يمكنك أن تمسكه طويلا؟",
      answer: "النفس",
      image: ""
    },
    "q13": {
      text: "من التجّار لو قمنا باقتلاع عينه طار، فمن هو؟",
      answer: "عطار",
      image: ""
    },
    "q14": {
      text: "انا موجود في المطاعم و البيوت و يخافون مني رغم اني لا اراهم ولا اسمعهم وعندما يسيئ استخدامي سقطت على الارض مباشره؟",
      answer: "السكين",
      image: ""
    },
    "q15": {
      text: "شيء لا يؤكل في الليل أبداً ما هو؟",
      answer: "الفطور او الغدا",
      image: ""
    },
    "q16": {
      text: "رقم سري مكون من 3 ارقام مجموعهم يساوي 13 الرقم الاول اقل من الرقم الثاني والرقم الثاني  اكبر من الرقم الثالث الرقم الاول والثالث اعداد اوليا ولايوجد رقم اكبر من 7  فما هو الرقم السري؟ ",
      answer: "الاول 2 - الثاني 6 - الثالث 5",
      image: ""
    },
    "q17": {
      text: "اسم رجل من ٤ احرف اذا حذفت منه اول حرف تبقى حرف ما هو؟",
      answer: "براء",
      image: ""
    },
    "q18": {
      text: "شيء يؤخذ منك قبل أن يعطى لك؟",
      answer: "الصورة",
      image: ""
    },
    "q19": {
      text: "تراني جمادًا ولكن أذوبُ وفي لمحةٍ أختفي لا أعودُ أزيل الأذى دون سيفٍ ولا قتالٍ، ولكن عدوي لدودُ",
      answer: "الصابون",
      image: ""
    },
    "q20": {
      text: "أنا أتيت من الماضي، أعيش في الحاضر، وأخشى أن أكون في المستقبل. أتحرك كل يوم ولكنني لا أترك أثرًا. فمن أكون؟",
      answer: "الوقت",
      image: ""
    },
    "q21": {
      text: "أنا شيء إذا لمستني صرخت، وإذا تركتني هدأت، أعيش في كل مكان، لا تراني لكن تشعر بي",
      answer: "الكهرباء",
      image: ""
    },
    "q22": {
      text: "أنشدك عن رجلٍ كبيرٍ مقامه، يامر وينهي دون رجلين ويدين، تشوفه قدامك وتاخذ بكلامه، وتمشي في دربه في جميع الميادين.",
      answer: "التقويم",
      image: ""
    },
    "q23": {
      text: "إذا قمت بإضافة العدد 6 إلى العدد 11 وحصلت على الناتج 5، وكان هذا الناتج صحيحًا فكيف حصلت هذه النتيجة؟",
      answer: "إذا قمنا بإضافة 6 ساعات إلى الساعة 11 فإن الناتج سيكون هو الساعة الخامسة ",
      image: ""
    },
    "q24": {
      text: "ما هو الشيء الذي يمكن أن يكون أكبر من الكون ولكنه لا يمتلك أي وزن؟",
      answer: "الفراغ",
      image: ""
    },
    "q25": {
      text: "شيء يجوز اهدائه ولا يجوز بيعه؟",
      answer: "الاضحية",
      image: ""
    },
    "q26": {
      text: "تضرب بلا سبب ، وتطير بلا جناح ، وتسبب الفرح والغضب ، فما هي ؟",
      answer: "الكورة",
      image: ""
    },
    "q27": {
      text: "ماهو الشيء الذي يدخل الماء ولا يبتل؟",
      answer: "الضوء",
      image: ""
    },
    "q28": {
      text: "أنا شيء مذكور في قصة سقوط عظيم، ألهم العقول وأثار العلوم، لوني مو ثابت وشكلي مألوف، من أكون؟",
      answer: "التفاح",
      image: ""
    },
    "q29": {
      text: "أستطيع أن أعيش فقط إذا كان الضوء موجود، لكنني أموت إذا سطع الضوء عليّ، من أنا؟",
      answer: "الظل",
      image: ""
    },
    "q30": {
      text: "أنا شيء صغير، أستطيع أن أحمل جبالًا وأقوم بأشياء عظيمة، ولكنني لا أستطيع التحرك. من أكون؟",
      answer: "الفكرة",
      image: ""
    },
    "q31": {
      text: "ما الذي لا يمكنك وضعه في الوعاء؟",
      answer: "غطاء الوعاء",
      image: ""
    },
    "q32": {
      text: "ما هو الشيء الذي يولد أسود، ويعيش أحمر، ويموت أبيض؟",
      answer: "الفحم",
      image: ""
    },
    "q33": {
      text: "ما هو الشيء الذي يكتب ولا يقرأ؟",
      answer: "القلم",
      image: ""
    },
    "q34": {
      text: "أنا شيءٌ أقوى من الحديد لكنني أخف من الريشة، أبني الجسور وأهدم الجدران، فما أنا؟",
      answer: "الكلمة",
      image: ""
    },
    "q35": {
      text: "ما هو الشيء الذي يحمل طعامه فوق رأسه، فإذا مشى أكل منه وإذا سكن غطّى رأسه ونام؟",
      answer: "قلم الحبر",
      image: ""
    },


  },

  

  10: {
    "q1": {
      text: "من اليسار لليمين*اضغط على الصورة*",
      answer: "بخ + اخ = بخاخ",
      image: "./images/1.jpg"
    },
    "q2": {
      text: "من اليسار لليمين*اضغط على الصورة*",
      answer: "مع + دن = معدن",
      image: "./images/2.jpg"
    },
    "q3": {
      text: "من اليسار لليمين*اضغط على الصورة*",
      answer: "اي + مان = ايمان",
      image: "./images/3.jpg"
    },
    "q4": {
      text: "من اليسار لليمين*اضغط على الصورة*",
      answer: "تمر + ين = تمرين",
      image: "./images/4.jpg"
    },
    "q5": {
      text: "من اليسار لليمين*اضغط على الصورة*",
      answer: "بخ + ار = بخار",
      image: "./images/5.jpg"
    },
    "q6": {
      text: "من اليسار لليمين*اضغط على الصورة*",
      answer: "دور + ار = دوران",
      image: "./images/6.jpg"
    },
    "q7": {
      text: "من اليسار لليمين*اضغط على الصورة*",
      answer: "ذا + كرة = ذاكرة",
      image: "./images/7.jpg"
    },
    "q8": {
      text: "من اليسار لليمين*اضغط على الصورة*",
      answer: "انا + ني = اناني",
      image: "./images/8.jpg"
    },
    "q9": {
      text: "من اليسار لليمين*اضغط على الصورة*",
      answer: "حر + بي = حربي",
      image: "./images/9.jpg"
    },
    "q10": {
      text: "من اليسار لليمين*اضغط على الصورة*",
      answer: "حر + كات = حركات",
      image: "./images/10.jpg"
    },
    "q11": {
      text: "من اليسار لليمين*اضغط على الصورة*",
      answer: "حر + مان = حرمان ",
      image: "./images/11.jpg"
    },
    "q12": {
      text: "من اليسار لليمين*اضغط على الصورة*",
      answer: "مق + ام = مقام",
      image: "./images/12.jpg"
    },
    "q13": {
      text: "من اليسار لليمين*اضغط على الصورة*",
      answer: "ام + ام = امام",
      image: "./images/13.jpg"
    },
    "q14": {
      text: "من اليسار لليمين*اضغط على الصورة*",
      answer: "تم + ام = تمام",
      image: "./images/14.jpg"
    },
    "q16": {
      text: "من اليسار لليمين*اضغط على الصورة*",
      answer: "من + فصل = منفصل",
      image: "./images/16.jpg"
    },
    "q17": {
      text: "من اليسار لليمين*اضغط على الصورة*",
      answer: "من + سوب = منسوب",
      image: "./images/17.jpg"
    },
    "q18": {
      text: "من اليسار لليمين*اضغط على الصورة*",
      answer: "من + امه = منامه",
      image: "./images/18.jpg"
    },
    "q19": {
      text: "من اليسار لليمين*اضغط على الصورة*",
      answer: "من + ديل = منديل",
      image: "./images/19.jpg"
    },
    "q20": {
      text: "من اليسار لليمين*اضغط على الصورة*",
      answer: "من + حوت = منحوت",
      image: "./images/20.jpg"
    },
    "q21": {
      text: "من اليسار لليمين*اضغط على الصورة*",
      answer: "من + طق = منطق",
      image: "./images/21.jpg"
    },
    "q22": {
      text: "من اليسار لليمين*اضغط على الصورة*",
      answer: "من + شور = منشور",
      image: "./images/22.jpg"
    },
    "q23": {
      text: "من اليسار لليمين*اضغط على الصورة*",
      answer: "من + صور = منصور",
      image: "./images/23.jpg"
    },
  

  },
}


const stageConfigurations = {
  1: { category: "عامة", icon: "" },
  2: { category: "دينية", icon: "" },
  3: { category: "خمن الكلمة", icon: "" },
  4: { category: "دول", icon: "" },
  5: { category: "كودنيمز", icon: "" },
  6: { category: "علوم", icon: "" },
  7: { category: "حروف مبعثرة", icon: "" },
  8: { category: "عربي", icon: "" },
  9: { category: "الغاز", icon: "" },
  10: { category: "تحدي الصور", icon: "" }

};
